### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.send_api_v1 will be created
  + resource "azurerm_api_management_api" "send_api_v1" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Send AAR - API"
      + display_name          = "IO Send AAR - API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-weu-send-aar-api-01"
      + path                  = "api/v1/send"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  version: 1.0.0
                  title: "IO-COM SEND Service"
                  description: "Microservizio che espone API per
                    - verifica contenuto del QR-Code di un AAR SEND
                    - recuperare il contenuto di una notifica AAR SEND
                    - download degli allegati realtivi ad una notifica AAR SEND"
                  contact:
                    name: pagoPA - Touchpoints team
                servers:
                  - url: https://api-app.io.pagopa.it/api/v1/send
                    description: Ambiente di produzione
                paths:
                  /aar/notifications/{iun}:
                    get:
                      tags:
                        - SEND AAR Notifications
                      summary: Accesso ai dati della notifica
                      description: >-
                        Restituisce i dati di una notifica AAR SEND
                      operationId: getAARNotification
                      parameters:
                        - $ref: "#/components/parameters/pathIun"
                        - $ref: "#/components/parameters/queryMandateId"
                        - $ref: "#/components/parameters/headerIoSource"
                      responses:
                        "200":
                          description: OK
                          content:
                            application/io+json:
                              schema:
                                $ref: "#/components/schemas/ThirdPartyMessage"
                        "400":
                          description: Bad request
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "500":
                          description: Bad request
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                  /aar/qr-code-check:
                    post:
                      tags:
                        - SEND AAR QRCode
                      description: Verifica il contenuto del qrcode di un' AAR  e restituisce dati utili al recupero della notifica
                      summary: Servizio per la verifica del aar-qr-code
                      operationId: aarQRCodeCheck
                      parameters:
                        - in: query
                          name: isTest
                          schema:
                            type: boolean
                        - $ref: "#/components/parameters/headerIoSource"
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: "#/components/schemas/RequestCheckQrMandateDto"
                        required: true
                      responses:
                        "200":
                          description: OK
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/AARQRCodeCheckResponse"
                        "403":
                          description: Mandate not found
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/AARQRCodeCheckResponse"
                        "400":
                          description: Bad request
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "500":
                          description: Internal Server Error
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                  /aar/attachments/{urlEncodedBase64AttachmentUrl}:
                    get:
                      operationId: getNotificationAttachment
                      tags:
                        - SEND AAR Attachments
                      parameters:
                        - $ref: "#/components/parameters/urlEncodedBase64AttachmentUrl"
                        - $ref: "#/components/parameters/queryMandateId"
                        - $ref: "#/components/parameters/headerIoSource"
                        - in: query
                          name: isTest
                          schema:
                            type: boolean
                      responses:
                        "200":
                          description: Notification Details
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/NotificationAttachmentDownloadMetadataResponse"
                        "400":
                          description: Bad request
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "500":
                          description: Unexpected Error
                          content:
                            application/problem+json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                
                components:
                  parameters:
                    urlEncodedBase64AttachmentUrl:
                      name: urlEncodedBase64AttachmentUrl
                      in: path
                      required: true
                      schema:
                        type: string
                    headerIoSource:
                      name: x-pagopa-pn-io-src
                      in: header
                      description: User login source channel details, should be QR_CODE or left empty
                      required: false
                      schema:
                        type: string
                    pathIun:
                      description: Identificativo Univoco Notifica
                      name: iun
                      in: path
                      required: true
                      schema:
                        type: string
                        minLength: 25
                        maxLength: 25
                        pattern: ^[A-Z]{4}-[A-Z]{4}-[A-Z]{4}-[0-9]{6}-[A-Z]{1}-[0-9]{1}$
                    queryMandateId:
                      name: mandateId
                      description: Identificativo della delega
                      in: query
                      required: false
                      schema:
                        type: string
                        format: uuid
                  schemas:
                    NotificationAttachmentDownloadMetadataResponse:
                      description: |-
                        I due campi più importanti sono __url__ e __retryAfter__. <br/>
                          - __url__ è presente se il file è pronto per essere scaricato ed indica l'url a cui fare GET.
                          - __retryAfter__ indica che il file è stato archiviato e bisognerà aspettare un numero di
                            secondi non inferiore a quanto indicato dal campo _retryAfter_. <br/>
                      type: object
                      required:
                        - filename
                        - contentType
                        - contentLength
                        - sha256
                      properties:
                        filename:
                          type: string
                        contentType:
                          type: string
                          example: application/pdf
                        contentLength:
                          type: integer
                          format: int32
                          example: 54092
                          description: dimensione, in byte, del contenuto.
                        sha256:
                          type: string
                          description: SHA256 del contenuto del file.
                        url:
                          type: string
                          description: >-
                            URL preautorizzato a cui effettuare una richiesta GET per ottenere
                            il contenuto del documento. Presente solo se il documento è pronto
                            per il download.
                        retryAfter:
                          type: integer
                          format: int32
                          description: >-
                            Stima del numero di secondi da aspettare prima che il contenuto del
                            documento sia disponibile per il download.
                    ThirdPartyMessage:
                      type: object
                      properties:
                        attachments:
                          type: array
                          items:
                            $ref: "#/components/schemas/ThirdPartyAttachment"
                        details:
                          $ref: "#/components/schemas/IOReceivedNotification"
                    RequestCheckQrMandateDto:
                      description: Le informazioni fornite per verificare l'AAR-QR-CodeValue
                      type: object
                      required:
                        - aarQrCodeValue
                      properties:
                        aarQrCodeValue:
                          type: string
                          description: valore del token QR-Code presente sull'avviso di avvenuta ricezione
                          maxLength: 300
                    AARQRCodeCheckResponse:
                      description: >-
                        Le informazioni fornite in risposta alla verifica del AAR-QR-CodeValue
                        con possibile identificativo della delega attiva
                      type: object
                      required:
                        - iun
                        - recipientInfo
                      properties:
                        iun:
                          description: Identificativo Univoco Notifica
                          type: string
                          minLength: 25
                          maxLength: 25
                          pattern: ^[A-Z]{4}-[A-Z]{4}-[A-Z]{4}-[0-9]{6}-[A-Z]{1}-[0-9]{1}$
                        mandateId:
                          description: identificativo della delega
                          type: string
                        recipientInfo:
                          $ref: "#/components/schemas/UserInfo"
                    UserInfo:
                      type: object
                      required:
                        - denomination
                        - taxId
                      properties:
                        denomination:
                          type: string
                          description: Nome + cognome __oppure__ ragione sociale
                          example: Nome Cognome
                        taxId:
                          title: Codice Fiscale
                          description: Codice Fiscale
                          type: string
                          example: CGNNMO01T10A944Q
                    HttpStatusCode:
                      type: integer
                      format: int32
                      description: The HTTP status code generated by the origin server for this occurrence of the problem.
                      minimum: 100
                      maximum: 600
                      exclusiveMaximum: true
                      example: 200
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          $ref: "#/components/schemas/HttpStatusCode"
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the specific occurrence of the problem.
                            It may or may not yield further information if dereferenced.
                        errors:
                          type: array
                          minItems: 1
                          items:
                            $ref: "#/components/schemas/AARError"
                        traceId:
                          description: Internal support identifier associated to error
                          example: 123e4567-e89b-12d3-a456-426614174000
                          type: string
                      required:
                        - status
                        - detail
                    ThirdPartyAttachment:
                      type: object
                      properties:
                        id:
                          type: string
                          minLength: 1
                        content_type:
                          type: string
                          minLength: 1
                        name:
                          type: string
                          minLength: 1
                        url:
                          type: string
                          minLength: 1
                        category:
                          type: string
                          enum:
                            - DOCUMENT
                            - F24
                      required:
                        - id
                        - url
                        - category
                    IOReceivedNotification:
                      description: >-
                        Le informazioni riguardanti una richiesta di notifica accettata e il
                        processo di inoltro della notifica verso i destinatari (Persone
                        Fisiche o Giuridiche).
                      type: object
                      properties:
                        subject:
                          type: string
                        iun:
                          type: string
                        recipients:
                          type: array
                          items:
                            $ref: "#/components/schemas/NotificationRecipient"
                        notificationStatusHistory:
                          $ref: "#/components/schemas/NotificationStatusHistory"
                        abstract:
                          type: string
                        senderDenomination:
                          type: string
                        completedPayments:
                          description: elenco dei pagamenti completati
                          type: array
                          items:
                            description: Payment notice number  numero avviso
                            example: "302000100000019421"
                            type: string
                            maxLength: 18
                            minLength: 18
                            pattern: ^\d+$
                        isCancelled:
                          type: boolean
                          description: indica se la notifica è stata annullata
                      required:
                        - subject
                        - iun
                        - recipients
                        - notificationStatusHistory
                    NotificationRecipient:
                      description: Informazioni sui destinatari
                      required:
                        - denomination
                        - recipientType
                        - taxId
                      type: object
                      properties:
                        recipientType:
                          type: string
                          description: >
                            Tipologia di destinatario: Persona Fisica (PF) o Persona
                            Giuridica (PG). * `PF` * `PG`
                        taxId:
                          description: C.F. persona fisica o persona giuridica
                          type: string
                          x-field-extra-annotation: "@lombok.ToString.Exclude"
                          minLength: 11
                          maxLength: 16
                          pattern: >-
                            ^([A-Z]{6}[0-9LMNPQRSTUV]{2}[A-Z]{1}[0-9LMNPQRSTUV]{2}[A-Z]{1}[0-9LMNPQRSTUV]{3}[A-Z]{1})|([0-9]{11})$
                        denomination:
                          $ref: "#/components/schemas/Denomination"
                        payment:
                          $ref: "#/components/schemas/NotificationPaymentInfo"
                    Denomination:
                      description: >-
                        Denominazione ente o persona fisica / ragione sociale. La
                        codifica prevede i caratteri ISO LATIN 1, senza | e senza
                        i caratteri di controllo, ovvero la seguente regexp: ^[
                        -{}~\u00A0-ÿ]*$
                      type: string
                      x-field-extra-annotation: "@lombok.ToString.Exclude"
                      minLength: 1
                      pattern: ^.*$
                    NotificationPaymentInfo:
                      description: >-
                        Informazioni utili per effettuare il pagamento di una
                        notifica, sono associate al destinatario perché le spese
                        di notifica possono differire a seconda del canale di
                        notifica utilizzato. <br/>
                          - _noticeCode_: "codice avviso pagoPA" di pagamento del sistema pagoPA, usato per pagamento online.<br/>
                          - _creditorTaxId_: codice fiscale dell'ente a cui fa riferimento il "codice avviso pagoPA". <br/>
                      type: object
                      required:
                        - noticeCode
                        - creditorTaxId
                      properties:
                        noticeCode:
                          $ref: "#/components/schemas/NoticeCode"
                        creditorTaxId:
                          $ref: "#/components/schemas/PaTaxId"
                    NotificationStatusHistory:
                      description: elenco degli avanzamenti effettuati dal processo di notifica
                      type: array
                      items:
                        $ref: "#/components/schemas/NotificationStatusHistoryElement"
                    NotificationStatusHistoryElement:
                      description: elenco degli avanzamenti effettuati dal processo di notifica
                      type: object
                      required:
                        - status
                        - activeFrom
                        - relatedTimelineElements
                      properties:
                        status:
                          type: string
                          description: |
                            stato di avanzamento del processo di notifica:
                              * `IN_VALIDATION` - notifica depositata in attesa di validazione
                              * `ACCEPTED` - notifica accettata
                              * `REFUSED` - notifica rifiutata
                              * `DELIVERING` - notifica in spedita
                              * `DELIVERED` - notifica ricevuta da tutti i destinatari
                              * `VIEWED` - notifica presa visione per almeno un destinatario
                              * `EFFECTIVE_DATE` - notifica perfezionata per un destinatario
                              * `PAID` - notifica pagata
                              * `UNREACHABLE` - notifica non recapitabile
                              * `CANCELLED` - notifica annullata dal mittente
                              * `PAID` - [DEPRECATO] Uno dei destinatari ha pagato la notifica
                              * `RETURNED_TO_SENDER` - La notifica è stata restituita al mittente
                        activeFrom:
                          type: string
                          description: data e ora di raggiungimento dello stato di avanzamento
                          format: date-time
                        relatedTimelineElements:
                          type: array
                          description: Eventi avvenuti nello stato
                          items:
                            type: string
                    NoticeCode:
                      maxLength: 18
                      minLength: 18
                      pattern: ^\d+$
                      type: string
                      description: Payment notice number  numero avviso
                      example: "302000100000019421"
                    PaTaxId:
                      maxLength: 11
                      minLength: 11
                      pattern: ^\d+$
                      type: string
                      description: Payment PA fiscal code
                      example: "77777777777"
                    AARError:
                      properties:
                        code:
                          description: Internal code of the error, in human-readable format
                          example: >-
                            PN_PARAMETER_TOO_LONG | PN_PARAMETER_TOO_SHORT |
                            PN_DUPLICATE_ENTRY | etc...
                          type: string
                        element:
                          description: Parameter or request body field name for validation error
                          example: body.order.item[2].quantity
                          type: string
                        detail:
                          description: >-
                            A human readable explanation specific to this occurrence of
                            the problem.
                          example: Parameter not valid
                          maxLength: 1024
                          type: string
                      required:
                        - code
                  securitySchemes:
                    Bearer:
                      type: apiKey
                      in: header
                      name: Authorization
                security:
                  - Bearer: []
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.send_aar_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "send_aar_api_v1_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-weu-send-aar-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base /> <fragment>
            	<!-- Extract the token from the Authorization Header -->
            	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";   }" />
            	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
            	<choose>
            		<when condition="@(       string.IsNullOrEmpty((string)context.Variables["token"]) ||       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))     )">
            			<set-header name="Content-Type" exists-action="override">
            				<value>application/json</value>
            			</set-header>
            			<return-response>
            				<set-status code="401" reason="Unauthorized" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</when>
            	</choose>
            	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
            	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
            		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
            		<set-method>GET</set-method>
            		<set-header name="Content-Type" exists-action="override">
            			<value>application/json</value>
            		</set-header>
            		<set-header name="Authorization" exists-action="override">
            			<value>@(((string)context.Variables["token"]))</value>
            		</set-header>
            	</send-request>
            	<choose>
            		<!-- If 200 return set the x-user header as the base64 of the response -->
            		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
            			<!-- Parse the introspectionResponse as a string -->
            			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As<string>())" />
            			<!-- Remove the Authorization Header -->
            			<set-header name="Authorization" exists-action="delete" />
            			<!-- Set the x-user header with the user data -->
            			<set-header name="x-user" exists-action="override">
            				<value>@(
                      Convert.ToBase64String(
                          System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
                      )
                    )</value>
            			</set-header>
            		</when>
            		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
            			<return-response response-variable-name="introspectionErrorResponse">
            				<set-status code="401" reason="Unauthorized" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</when>
            		<otherwise>
            			<set-header name="Content-Type" exists-action="override">
            				<value>application/json</value>
            			</set-header>
            			<return-response response-variable-name="introspectionErrorResponse">
            				<set-status code="500" reason="Internal Server Error" />
            				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
            			</return-response>
            		</otherwise>
            	</choose>
            </fragment>
             <set-backend-service
                  base-url="https://io-p-itn-com-send-func-01/api/v1" />
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.apim.azurerm_api_management_policy_fragment.auth will be updated in-place
  ~ resource "azurerm_api_management_policy_fragment" "auth" {
        id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/policyFragments/io-com-app-session-fragment"
        name              = "io-com-app-session-fragment"
      ~ value             = <<-EOT
          - <fragment>
          + <fragment>
          - 	<!-- Extract the token from the Authorization Header -->
          + 	<!-- Extract the token from the Authorization Header -->
          - 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue(&quot;Authorization&quot;, out values) ? values.FirstOrDefault() : &quot;&quot;;   }" />
          + 	<set-variable name="token" value="@{     string[] values;     return context.Request.Headers.TryGetValue("Authorization", out values) ? values.FirstOrDefault() : "";   }" />
          - 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          + 	<!-- Check if the Authorization header is valid, if not return 401 Unauthorized -->
          - 	<choose>
          + 	<choose>
          - 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables[&quot;token&quot;]) ||       !(((string)context.Variables[&quot;token&quot;]).StartsWith(&quot;Bearer &quot;, StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables[&quot;token&quot;]).Substring(7))     )">
          + 		<when condition="@(       string.IsNullOrEmpty((string)context.Variables["token"]) ||       !(((string)context.Variables["token"]).StartsWith("Bearer ", StringComparison.OrdinalIgnoreCase)) ||       string.IsNullOrWhiteSpace(((string)context.Variables["token"]).Substring(7))     )">
          - 			<set-header name="Content-Type" exists-action="override">
          + 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          + 				<value>application/json</value>
          - 			</set-header>
          + 			</set-header>
          - 			<return-response>
          + 			<return-response>
          - 				<set-status code="401" reason="Unauthorized" />
          + 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          + 			</return-response>
          - 		</when>
          + 		</when>
          - 	</choose>
          + 	</choose>
          - 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          + 	<!-- Call the session manager, pasing the bearer token, to get the user identity -->
          - 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          + 	<send-request mode="new" response-variable-name="introspectionResponse" timeout="10" ignore-error="false">
          - 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          + 		<set-url>https://io-p-weu-session-manager-app-03.azurewebsites.net/api/auth/v1/user-identity</set-url>
          - 		<set-method>GET</set-method>
          + 		<set-method>GET</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          + 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          + 			<value>application/json</value>
          - 		</set-header>
          + 		</set-header>
          - 		<set-header name="Authorization" exists-action="override">
          + 		<set-header name="Authorization" exists-action="override">
          - 			<value>@(((string)context.Variables["token"]))</value>
          + 			<value>@(((string)context.Variables["token"]))</value>
          - 		</set-header>
          + 		</set-header>
          - 	</send-request>
          + 	</send-request>
          - 	<choose>
          + 	<choose>
          - 		<!-- If 200 return set the x-user header as the base64 of the response -->
          + 		<!-- If 200 return set the x-user header as the base64 of the response -->
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 200)">
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 200)">
          - 			<!-- Parse the introspectionResponse as a string -->
          + 			<!-- Parse the introspectionResponse as a string -->
          - 			<set-variable name="userData" value="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).Body.As&lt;string&gt;())" />
          + 			<set-variable name="userData" value="@(((IResponse)context.Variables["introspectionResponse"]).Body.As<string>())" />
          - 			<!-- Remove the Authorization Header -->
          + 			<!-- Remove the Authorization Header -->
          - 			<set-header name="Authorization" exists-action="delete" />
          + 			<set-header name="Authorization" exists-action="delete" />
          - 			<!-- Set the x-user header with the user data -->
          + 			<!-- Set the x-user header with the user data -->
          - 			<set-header name="x-user" exists-action="override">
          + 			<set-header name="x-user" exists-action="override">
          - 				<value>@(
          + 				<value>@(
          -           Convert.ToBase64String(
          +           Convert.ToBase64String(
          -               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          +               System.Text.Encoding.UTF8.GetBytes(((string)context.Variables["userData"]))
          -           )
          +           )
          -         )</value>
          +         )</value>
          - 			</set-header>
          + 			</set-header>
          - 		</when>
          + 		</when>
          - 		<when condition="@(((IResponse)context.Variables[&quot;introspectionResponse&quot;]).StatusCode == 401)">
          + 		<when condition="@(((IResponse)context.Variables["introspectionResponse"]).StatusCode == 401)">
          - 			<return-response response-variable-name="introspectionErrorResponse">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="401" reason="Unauthorized" />
          + 				<set-status code="401" reason="Unauthorized" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          + 			</return-response>
          - 		</when>
          + 		</when>
          - 		<otherwise>
          + 		<otherwise>
          - 			<set-header name="Content-Type" exists-action="override">
          + 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          + 				<value>application/json</value>
          - 			</set-header>
          + 			</set-header>
          - 			<return-response response-variable-name="introspectionErrorResponse">
          + 			<return-response response-variable-name="introspectionErrorResponse">
          - 				<set-status code="500" reason="Internal Server Error" />
          + 				<set-status code="500" reason="Internal Server Error" />
          - 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          + 				<set-body>{"title": "Proxy Error", "status": 401, "detail": "Unauthorized"}</set-body>
          - 			</return-response>
          + 			</return-response>
          - 		</otherwise>
          + 		</otherwise>
          - 	</choose>
          + 	</choose>
            </fragment>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_product.apim_itn_product_send_aar will be created
  + resource "azurerm_api_management_product" "apim_itn_product_send_aar" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for IO SEND AAR API"
      + display_name          = "IO SEND AAR API"
      + id                    = (known after apply)
      + product_id            = "io-send-aar-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.apim.azurerm_api_management_product_api.send_aar_api_v1_product_api will be created
  + resource "azurerm_api_management_product_api" "send_aar_api_v1_product_api" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-weu-send-aar-api-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim.azurerm_api_management_product_policy.apim_itn_product_send_policy will be created
  + resource "azurerm_api_management_product_policy" "apim_itn_product_send_policy" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-send-aar-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <!-- PRIVATE PRODUCT -->
                    <ip-filter action="allow">
                        <address-range from="10.0.0.0" to="10.255.255.255" />
                        <address-range from="172.16.2.0" to="172.16.2.255" />
                    </ip-filter>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.notification_hubs_itn.azurerm_monitor_metric_alert.alert_nh_partitions_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_partitions_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partitions have an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = false
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.notification_hubs_itn.azurerm_monitor_metric_alert.alert_nh_partitions_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_partitions_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partitions incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[IOCOM][NH]Push Notification Service errors"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "Medium"
          + evaluation_failure_count = 4
          + evaluation_total_count   = 4
          + metric_name              = "outgoing.allpns.pnserror"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_1 will be created
  + resource "azurerm_notification_hub" "partition_1" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-01"
      + namespace_name      = "io-p-itn-com-nhns-01"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_2 will be created
  + resource "azurerm_notification_hub" "partition_2" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-02"
      + namespace_name      = "io-p-itn-com-nhns-02"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_3 will be created
  + resource "azurerm_notification_hub" "partition_3" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-03"
      + namespace_name      = "io-p-itn-com-nhns-03"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.partition_4 will be created
  + resource "azurerm_notification_hub" "partition_4" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-04"
      + namespace_name      = "io-p-itn-com-nhns-04"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub.sandbox will be created
  + resource "azurerm_notification_hub" "sandbox" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-nh-sandbox"
      + namespace_name      = "io-p-itn-com-nhns-sandbox"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + apns_credential {
          + application_mode = "Production"
          + bundle_id        = "it.pagopa.app.io"
          + key_id           = "PL6AXY2HSQ"
          + team_id          = "M2X5YQ4BJ7"
          + token            = (sensitive value)
        }

      + gcm_credential {
          + api_key = (sensitive value)
        }
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_1_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_1_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-01"
      + notification_hub_name       = "io-p-itn-com-nh-01"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_1_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_1_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-01"
      + notification_hub_name       = "io-p-itn-com-nh-01"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_2_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_2_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-02"
      + notification_hub_name       = "io-p-itn-com-nh-02"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_2_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_2_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-02"
      + notification_hub_name       = "io-p-itn-com-nh-02"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_3_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_3_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-03"
      + notification_hub_name       = "io-p-itn-com-nh-03"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_3_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_3_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-03"
      + notification_hub_name       = "io-p-itn-com-nh-03"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_4_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_4_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-04"
      + notification_hub_name       = "io-p-itn-com-nh-04"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.partition_4_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "partition_4_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-04"
      + notification_hub_name       = "io-p-itn-com-nh-04"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.sandbox_default_full will be created
  + resource "azurerm_notification_hub_authorization_rule" "sandbox_default_full" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = true
      + name                        = "DefaultFullSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-sandbox"
      + notification_hub_name       = "io-p-itn-com-nh-sandbox"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = true
    }

  # module.notification_hubs_itn.azurerm_notification_hub_authorization_rule.sandbox_default_listen will be created
  + resource "azurerm_notification_hub_authorization_rule" "sandbox_default_listen" {
      + id                          = (known after apply)
      + listen                      = true
      + manage                      = false
      + name                        = "DefaultListenSharedAccessSignature"
      + namespace_name              = "io-p-itn-com-nhns-sandbox"
      + notification_hub_name       = "io-p-itn-com-nh-sandbox"
      + primary_access_key          = (sensitive value)
      + primary_connection_string   = (sensitive value)
      + resource_group_name         = "io-p-itn-com-rg-01"
      + secondary_access_key        = (sensitive value)
      + secondary_connection_string = (sensitive value)
      + send                        = false
    }

Plan: 22 to add, 1 to change, 0 to destroy.
```

</details>
